Revit 2027 API
ParameterTypeId.SlantedColumnGeometryTreatmentTop Property
 "Top Geometry Alignment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SlantedColumnGeometryTreatmentTop { get; }
Public Shared ReadOnly Property SlantedColumnGeometryTreatmentTop As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SlantedColumnGeometryTreatmentTop {
	ForgeTypeId^ get ();
}
static member SlantedColumnGeometryTreatmentTop : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace